In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [5]:
df

  key1 key2     data1     data2
0    a  one -1.065706 -1.620224
1    a  two -0.735521  0.346617
2    b  one  0.716438  1.141403
3    b  two -0.002111 -0.296491
4    a  one -2.378036 -0.915160

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a   -1.393088
b    0.357164
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -1.721871
      two    -0.735521
b     one     0.716438
      two    -0.002111
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -1.721871 -0.735521
b     0.716438 -0.002111

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [13]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [14]:
df['data1'].groupby([states, years]).mean()

California  2005   -0.735521
            2006    0.716438
Ohio        2005   -0.533908
            2006   -2.378036
Name: data1, dtype: float64

In [15]:
df.groupby('key1').mean()

         data1     data2
key1
a    -1.393088 -0.729589
b     0.357164  0.422456

In [16]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -1.721871 -1.267692
     two  -0.735521  0.346617
b    one   0.716438  1.141403
     two  -0.002111 -0.296491

In [17]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [20]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -1.065706 -1.620224
1    a  two -0.735521  0.346617
4    a  one -2.378036 -0.915160
b
  key1 key2     data1     data2
2    b  one  0.716438  1.141403
3    b  two -0.002111 -0.296491

In [22]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print( k1, k2)
    print( group)

a one
  key1 key2     data1     data2
0    a  one -1.065706 -1.620224
4    a  one -2.378036 -0.915160
a two
  key1 key2     data1     data2
1    a  two -0.735521  0.346617
b one
  key1 key2     data1     data2
2    b  one  0.716438  1.141403
b two
  key1 key2     data1     data2
3    b  two -0.002111 -0.296491

In [23]:
pieces = dict(list(df.groupby('key1')))

In [24]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.716438  1.141403
3    b  two -0.002111 -0.296491

In [25]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [26]:
grouped = df.groupby(df.dtypes, axis=1)

In [27]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -1.065706 -1.620224
1 -0.735521  0.346617
2  0.716438  1.141403
3 -0.002111 -0.296491
4 -2.378036 -0.915160
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [29]:
people = pd.DataFrame(np.random.randn(5, 5),
columns=['a', 'b', 'c', 'd', 'e'],
index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [31]:
people.iloc[2:3, ['b', 'c']] = np.nan

IndexError: only integers, slices (`:`), ellipsis (`...`), numpy.newaxis (`None`) and integer or boolean arrays are valid indices

In [32]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [33]:
by_column = people.groupby(mapping, axis=1)

In [34]:
by_column.sum()

            blue       red
Joe     0.909390  0.949916
Steve  -0.782161 -1.379455
Wes     0.154545  0.805120
Jim    -0.659613 -1.640427
Travis  1.149501  0.285702

In [36]:
map_series = pd.Series(mapping)

In [37]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [38]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [39]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.493106  1.477249 -1.908520  2.312842 -0.869535
5 -0.848658 -1.670469  0.783296 -1.565457  1.139672
6  0.401578  1.554961 -0.120693  1.270194 -1.670837

In [40]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [41]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.554313  1.233875 -0.802633  0.957178 -0.315068
  two  0.280588 -1.096193 -0.755569  0.095956 -0.824821
5 one -0.848658 -1.670469  0.783296 -1.565457  1.139672
6 two  0.401578  1.554961 -0.120693  1.270194 -1.670837

In [42]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
[1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [44]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [45]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.193072 -0.513633  0.582298  0.915740  0.284034
1      0.690202 -0.298216  2.092336  0.279535  0.503616
2      1.411343 -0.278750  0.508251 -0.520856  0.351405
3     -0.875875  0.034366 -0.496724  0.252323  0.153145

In [46]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [47]:
df

  key1 key2     data1     data2
0    a  one -1.065706 -1.620224
1    a  two -0.735521  0.346617
2    b  one  0.716438  1.141403
3    b  two -0.002111 -0.296491
4    a  one -2.378036 -0.915160

In [48]:
grouped = df.groupby('key1')

In [49]:
grouped['data1'].quantile(0.9)

key1
a   -0.801558
b    0.644584
Name: data1, dtype: float64

In [51]:
def peak_to_peak(arr):
    return arr.max()- arr.min()

In [52]:
grouped.agg(peak_to_peak)

/usr/lib/python3/dist-packages/pandas/core/groupby/generic.py:303: FutureWarning: Dropping invalid columns in SeriesGroupBy.agg is deprecated. In a future version, a TypeError will be raised. Before calling .agg, select only columns which should be valid for the aggregating function.
  results[key] = self.aggregate(func)

         data1     data2
key1
a     1.642514  1.966841
b     0.718549  1.437894

In [53]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -1.393088  0.868820 -2.378036 -1.721871 -1.065706 -0.900614
b      2.0  0.357164  0.508091 -0.002111  0.177527  0.357164  0.536801

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a    -0.735521   3.0 -0.729589  0.996465 -1.620224 -1.267692 -0.915160
b     0.716438   2.0  0.422456  1.016744 -0.296491  0.062982  0.422456


           75%       max
key1
a    -0.284272  0.346617
b     0.781929  1.141403

In [54]:
tips = pd.read_csv('examples/tips.csv')

In [55]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [56]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [57]:
grouped = tips.groupby(['day', 'smoker'])

In [58]:
grouped_pct = grouped['tip_pct']

In [59]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [60]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [61]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [62]:
functions = ['count', 'mean', 'max']

In [63]:
result = grouped['tip_pct', 'total_bill'].agg(functions)

/tmp/ipykernel_32305/1540724723.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  result = grouped['tip_pct', 'total_bill'].agg(functions)

In [64]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [65]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [66]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [67]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

/tmp/ipykernel_32305/514018043.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  grouped['tip_pct', 'total_bill'].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [68]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [69]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40